{"data":{"markdownRemark":{"html":"<!--\n- what this blog is\n- where did it come from\n- your interest in graphics today and how it affects you\n- find it amazing how graphics is closer and closer to reality as time goes on\n- want to be part of that pursuit to make things more visually realistic and beautiful\n- blog will be that log/record of my personal pursuit\n- personal pursuit includes graphics experiments, graphics discussions and other musings of games and graphics\n- hope that some day this log/record of my personal pursuit will help others\n-->\n<p>Hello! This is my first post on my blog, hopefully one of many others! This blog will be used to share my experiments, personal projects, and other musings about games, graphics and rendering.<br>\n<br>\nVideo games have been a part of my life for as long as I remember, but I especially enjoyed and appreciated the visual realism in them. Earliest memories included playing with Crysis and its extensive amount of graphical effects. I would see what changing various settings did to the game visually and read up on the game's many sophisticated rendering techniques. It amazed me how the game did it's best to mirror reality and intrigued me what was done to accomplish that. I saw beauty in pushes for visual realism.<br>\n<br>\nThis admiration and appreciation for realism and beauty in games carries on today through my goals and endeavors with graphics. Studios push the boundaries on realism and beauty in rendering, in a pursuit of getting closer and closer to reality. I want to take part in this pursuit.<br>\n<br>\nThis blog will be an archive of my personal pursuit. I hope that some day this blog will be a large library of my experiments and experiences, written down and archived for me to reflect on and for others to read, explore and perhaps even learn from.<br>\n<br>\nThank you for reading, and stay tuned for what this blog holds!</p>\n<!-- end -->","frontmatter":{"date":"February 26, 2019","path":"/blog/welcome-blog","title":"In Pursuit of Realism"}}},"pageContext":{}}